import type { DiZhi } from './data'

/** 值使规则 - [时支, 时支阴阳, 五行, 经络, 值使穴, 穴性] */
export const ZHI_SHI: Array<[DiZhi, '阳' | '阴', string, string, string, string]> = [
  ['子', '阳', '水', '胆经', '侠谿', '荥穴'],
  ['丑', '阴', '火', '肝经', '行间', '荥穴'],
  ['寅', '阳', '木', '肺经', '少商', '井穴'],
  ['卯', '阴', '土', '大肠经', '曲池', '合穴'],
  ['辰', '阳', '火', '胃经', '解谿', '经穴'],
  ['巳', '阴', '金', '脾经', '商丘', '经穴'],
  ['午', '阳', '原', '心经', '通里', '原穴'],
  ['未', '阴', '原', '小肠经', '腕骨', '原穴'],
  ['申', '阳', '土', '膀胱经', '委中', '合穴'],
  ['酉', '阴', '水', '肾经', '阴谷', '合穴'],
  ['戌', '阳', '金', '心包经', '间使', '经穴'],
  ['亥', '阴', '木', '三焦经', '中渚', '输穴'],
]
