import type { DiZhi } from './data'

/** 值阳/值阴 - [模式, 日阴阳, 时支, 经络, 穴位, 穴性] */
export const ZHI_YANG_YIN: Array<['值阳' | '值阴', '阳' | '阴', DiZhi, string, string, string]> = [
  ['值阳', '阳', '子', '三焦经', '关冲', '井金'],
  ['值阳', '阳', '丑', '三焦经', '关冲', '井金'],
  ['值阳', '阳', '寅', '三焦经', '液门', '荥水'],
  ['值阳', '阳', '卯', '三焦经', '液门', '荥水'],
  ['值阳', '阳', '辰', '三焦经', '中渚', '输木'],
  ['值阳', '阳', '巳', '三焦经', '中渚', '输木'],
  ['值阳', '阳', '午', '三焦经', '阳池', '原穴'],
  ['值阳', '阳', '未', '三焦经', '阳池', '原穴'],
  ['值阳', '阳', '申', '三焦经', '支沟', '经火'],
  ['值阳', '阳', '酉', '三焦经', '支沟', '经火'],
  ['值阳', '阳', '戌', '三焦经', '天井', '合土'],
  ['值阳', '阳', '亥', '三焦经', '天井', '合土'],
  ['值阴', '阴', '子', '心包经', '中冲', '井木'],
  ['值阴', '阴', '丑', '心包经', '中冲', '井木'],
  ['值阴', '阴', '寅', '心包经', '劳宫', '荥火'],
  ['值阴', '阴', '卯', '心包经', '劳宫', '荥火'],
  ['值阴', '阴', '辰', '心包经', '大陵', '输土'],
  ['值阴', '阴', '巳', '心包经', '大陵', '输土'],
  ['值阴', '阴', '午', '心包经', '内关', '原穴'],
  ['值阴', '阴', '未', '心包经', '内关', '原穴'],
  ['值阴', '阴', '申', '心包经', '间使', '经金'],
  ['值阴', '阴', '酉', '心包经', '间使', '经金'],
  ['值阴', '阴', '戌', '心包经', '曲泽', '合水'],
  ['值阴', '阴', '亥', '心包经', '曲泽', '合水'],
]
